# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
df.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 3. Assign it to a variable called baby_names.

### Step 4. See the first 10 entries

In [3]:
df.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [38]:
df.drop([df.columns[0], 'Id'], axis = 1, inplace = True)

In [39]:
df.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [45]:
df.groupby(by = 'Gender').count()

          Name    Year   State   Count
Gender
F       558846  558846  558846  558846
M       457549  457549  457549  457549

In [50]:
df['Gender'].value_counts('M')

F    0.549832
M    0.450168
Name: Gender, dtype: float64

### Step 7. Group the dataset by name and assign to names

In [13]:
names = df.groupby(by = 'Name')

### Step 8. How many different names exist in the dataset?

In [16]:
len(names)

17632

In [24]:
len(names.Name.unique())

17632

### Step 9. What is the name with most occurrences?

In [28]:
df.groupby('Name')['Count'].sum().sort_values(ascending = False)

Name
Jacob          242874
Emma           214852
Michael        214405
Ethan          209277
Isabella       204798
William        197894
Joshua         191551
Sophia         191446
Daniel         191440
Emily          190318
Olivia         188036
Alexander      187189
Matthew        185279
Noah           179925
Anthony        179256
Andrew         174975
Christopher    172997
Joseph         169972
David          167606
Ava            167369
Madison        166959
Jayden         166864
James          162429
Logan          158186
Ryan           156507
Abigail        156236
Mason          149221
Benjamin       145867
Aiden          145774
Elijah         142851
                ...
Sadiee              5
Miqueas             5
Arna                5
Miquela             5
Tianah              5
Cicely              5
Armine              5
Mirai               5
Sadler              5
Thi                 5
Christoph           5
Chukwuebuka         5
Min                 5
Minah               5
Lochlann            5
Artavis             5
Janiaya             5
Sadye               5
Llana               5
Arshiya             5
Janila              5
Sady                5
Theodoros           5
Sadrac              5
Chuck               5
Janira              5
Arsalan             5
Lizvet              5
Janisha             5
Destenie            5
Name: Count, Length: 17632, dtype: int64

### Step 10. How many different names have the least occurrences?

In [33]:
df[df.Count == df['Count'].min()].shape

(147086, 6)

In [34]:
len(df[df.Count == df['Count'].min()])

147086

### Step 11. What is the median name occurrence?

In [35]:
df.Count.median()

11.0

### Step 12. What is the standard deviation of names?

In [36]:
df.Count.std()

97.39734648625934

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [37]:
df.describe()

                 Id          Year         Count
count  1.016395e+06  1.016395e+06  1.016395e+06
mean   2.830991e+06  2.009053e+03  3.485012e+01
std    1.652476e+06  3.138293e+00  9.739735e+01
min    1.135000e+04  2.004000e+03  5.000000e+00
25%    1.317328e+06  2.006000e+03  7.000000e+00
50%    2.811921e+06  2.009000e+03  1.100000e+01
75%    4.242556e+06  2.012000e+03  2.600000e+01
max    5.647426e+06  2.014000e+03  4.167000e+03